import tweepy
import os
import schedule
import time
import random
import keep_alive

ACCESS_TOKEN = os.environ['ACCESS_TOKEN']
ACCESS_TOKEN_SECRET = os.environ['ACCESS_TOKEN_SECRET']
CONSUMER_KEY = os.environ['CONSUMER_KEY']
CONSUMER_SECRET = os.environ['CONSUMER_SECRET']

keep_alive.keep_alive()
auth = tweepy.OAuthHandler(CONSUMER_KEY, CONSUMER_SECRET)
auth.set_access_token(ACCESS_TOKEN, ACCESS_TOKEN_SECRET)
api = tweepy.API(auth,wait_on_rate_limit=True)

lyrics = [
'''
فينا نفتح عينينا لما يرموا فيها تراب
قل لهم لسا شايفين
''',
'''
فينا نحلق فينا نطير لما نرضى بالزحف
إذا منحمل الشتي المصير يجي الربيع
''',
'''
خلي الناس تبيعد قلبي راح يفقع من رأسي
نزيف ممكن يفضحهم
والنزيف ممكن يصدمهم
''',
'''
قول للناس تبيعد مخي رح يفقع من صدري
والنزيف ممكن يعديهم
نزيف ممكن يشفيهم
''',
'''
فينا نرفض نأكل بعض ولو الناس شافت عظامنا
قل لهم مش جيعانين
''',
'''
حاج تؤكد على قفل الباب ما فيك تخبا
من يلي عمبيصير بجسمك
من يلي عمبيصير بجسمك
''',
'''
بحسّه بعده نايم حدّي
بيعني حلم يهرّبني
''',
'''
عم لفلف لحالي بتَخْتِي
كل ما يمّر المسحّراتي
''',
'''
لبّسني ضحكتي
ما الفرحة بتلبَقلِي
''',
'''
فليكن ما يكون بدي كون بعدني واقف عم غنّي
''',
'''
والإيام مثل الطاحون
أستهلك لذا أكون
''',
'''
حتى خيالي صار مرهون
بس اللّيل مش عم بيهُون
''',
'''
والناس حولي غريبين
مش أموات ولا عايشين
''',
'''
لو إيّامي معدودين
عم بعزف جوّات ڤيترين
''',
'''
بس بلبس ضحكتي
والفرحة بتِلبَقلي
''',
'''
كل النهار عم كِزّ باسناني
بوعى وعزرائيل قدامي
''',
'''
كلّن هون إيام الجوازة
بمشي لوحدي بالجنازة
''',
'''
تائه كأنني سفينة
فاضية بلا شي يرسيني
مروان تعا لهون وامسكني
قول لي بكرا الحال بيمشي
''',
'''
مش رح إستقبل الضيوف
لمّا بيتي عم بِيطوف
''',
'''
مش رح إستقبل الضيوف
كل شي حَوْلي عم بِيطُوف
''',
'''
هوني عندِك حياتك، وعندك كل عاداتك
وكبرتي كأن الإحساس بالغربة إنولد معك
''',
'''
بطّل يساعك جلدك، ولا بيساع أحلامك
خيفانة تنامي سنين وتوعي وبعدك بنت بيِّك
''',
'''
تِخونوه ايه، ما طول عمره بيخونكم
''',
'''
تِبيعـوه ايه، ما طول عمره بيـبيعكم
''',
'''
لمّا التربة مالحة ليش عم نزرع وُعود؟
''',
'''
قومي يا اختي سوقي فينا على الماكينة بلا ما نْعود
بكرا مِنْعُود
''',
'''
إمّك قالتلك عادي، قال بكرا بتتعوّدي،
وبتحكي مع العالم حولك بس بعدك وحيدة
والحقّ يقال جربتي، ولا مرة هربتي،
وبقيتي بالخندق بالخندق الغميق حاربتي
''',
'''
غنيت
مع كورس أشباح تحت رصاص مدينتي
''',
'''
لانتَشيت
عالكهربا من نخاع العامود
''',
'''
الطرابيش خذونا، عالحبوس عشان يخصونا، ويعملوا أوسام
''',
'''
خبز الغراب بدأ ينمى منورث الأرض غدًا يامّا
''',
'''
وانمحيت
من كِتب التاريخ كأنها تاريخك وهويتك
''',
'''
علّيلِي كعبك بالغنا
بعدها الأغاني ممكنة
''',
'''
خيّطنا لهم أعلامنا من أكفان جثث الأصحاب، اللّي كانوا عالإعدام
''',
'''
وقضّيت
عمري مع حقّي مرْهون لأّحاسيسك
''',
'''
بأوراكنا ترجمنالهم أبيات سافو وأبو نوّاس بلْسان الآهات
على شراشف طرّزناها بالآهات الّي نشدناها بالمظاهرات
''',
'''
إذا لمستِك بحلاوة رقصِك قربي عليّ شوي
في جحيم تحت جلدي وانت إيديك باردين
''',
'''
والجهلانين ملتحين بأوراق التّين
ومُقْمَحين وحواجبهم مَرفوعين
''',
'''
كتبوا حدود البلد عجسدي وجسدَك
والجلد بيكشّد الكلام
''',
'''
كلمتي عكلمتِك كجسدي عجسدَك
والجلد بيحرِّك الكلام
''',
'''
حاسسني حاسّة اللي إنت حاسس فيه
وين العيب حسّي اللي إنتِ حاسّة فيه
''',
'''
وبدُوق الوِسكي والأغلاط عـشفافِك
ما بتتعطّل لغة الكلام
''',
'''
الحروف بتلفّنا لمّا وشوِش كل أسراري بتِمْنا
وإنتَ بترجع لأيقوناتَك، وأنا للفراغ
''',
'''
قول لأمك ما تخاف الملهي علي بابه رصاص
''',
'''
علمونا عالملعب نلعب عصابات
''',
'''
شوب شوب أوّصوك
''',
'''
كنا سوى عم نتسلي وينك أختفيت؟
''',
'''
رابعاً ما تحكي مع نسوان
علشان ما نسهر عالجثمان
و ما الست بس مقياس
لكرامته قدام الناس
''',
'''
غالباً في طبنجة يچيابه
علشان الصبي إبن بيّه
''',
'''
هون ما حدا بينطال
ادونيس ضحية الادغال
''',
'''
أولاً سنة حلوة يا جميل
ثانياً الليل هيكون طويل
''',
'''
ثالثاً البس الاسود و إنزل
عالماً بس تتلُچ فوق التلال
و يصير الصبيان رچال
مغاوير بعصمة الليل
''',
'''
المشاريع بتزيد
بحجة بكرا بعيد
''',
'''
ما بيفهم كيف صار يشبه بيُّه وبعدُه بكل شي بيضيع
''',
'''
العين بتشتهي
بس ما بتطال الإيد
''',
'''
كل الآلات بتغنّيله وبتكبّلُه بأنابيب
''',
'''
والغنّية رح تتغنى
بكرا مش رح تبقى معنا
''',
'''
العين بتشتهي
الفرح اللّي بتدّعيه
''',
'''
كان المستقبل غير عن ذكريات هزيمة وتجاعيد
''',
'''
روّح سنينُه
لراحت أسنانُه
''',
'''
أخذ ترِين وترِين من بعده وبعده اللحن بيلحقه
''',
'''
بيرقص بالسهرة لحالو
(كأنه اللحن على الراديو كأنه اللحن على الراديو)
''',
'''
بيسأل اللحن على راديو
(إن كان بعده بحب نفسه إن بعده راضي بنفسه)
''',
'''
كأنه الزمن عبير بيمرّ وبيرميه من غير تنذير
''',
'''
كان عندو مشاريع
بس الحياة بتصير
شمع وريش - بكرا ما كان هيك
''',
'''
اللى مكتوب عالجبين
آخرته تشوفه العين
''',
'''
بتدوب الجوانح كلنا منهبط بلا جياب على الأكفان
''',
'''
علّمني أغنية الراديو
قال لي غنّيها عترابه
''',
'''
بالغابة منسهر باللّيل
منشرب من قلب الغزال
''',
'''
مننخر الأرض بعصيان
ليطوف الخمر من العين
''',
'''
كّل النسوان والرجال جايين لابسين الجلود
بانتظار اللّي بِيموت وبِيعود
''',
'''
رح نهجر حالنا
بس الله معنا
''',
'''
منسمع حكمة الأعناب
كل الحكم بالأعناب
''',
'''
رح غرّق حزني حإنسى إسمي حأعطي نفسي للّيل
''',
'''
وعمادة كبدي بالجن
برقص لعوذ من الجن
رح غطّس كبدي بالجن
باسم الأب والإبن
''',
'''
بكرا بس أوعى باللّيل يوم القيامة حَيْقوم
لكن الخمار ما بيوجع قد الهموم
''',
'''
بيني وبين فرحي حيط
بسمك زجاجة الكأس
''',
'''
برلين ما صمدت
ناولني وهبّط
''',
'''
ما اشربش القزوزة ولا الشاي أنا
''',
'''
فيّي إتخبّى بجلدك، فيّي إلبس كل وجوهك. هول
''',
'''
فيّي إتخبى بخزانتك، فيّي إلبس كل بدلاتك. بس قول
''',
'''
فيّي كونك إذا بدك، فيّي غنّي كل كلماتك. هول
''',
'''
فيّي مثلّك حياتك، لما تسمعني بمرايتك عم قول
''',
'''
بس قول لي مين بدي كون علشان أرضيك
اعطيني ثلاث دقائق - داريني بثلاث دقائق
''',
'''
فيي أوقف إذا بدك، أو أتمدد إذا ما بدك. قول
''',
'''
فيي اضحك إذا بدك، يا اما إبكي إذا أنسبلك. بس قول
''',
'''
بس قول لي مين بدي كون علشان أرضيك
إتركلي مهري عالطاولة - شكّ حلمك بخلخالي
''',
'''
ليه ليهمني أنّي كون بدل من أني صير؟
كل الأشياء بتعيش لتنتهي بلحن جديد
''',
'''
الفرق بين الحرية والخضوع تخيير
أنا اللي اخترت. أنا الي قبلت. أنا الي قلت
''',
'''
سمّي الشيطان بإسمه وسمّي الفنان كذاب
نصف الأشياء يلّي بحسّها بتجي من الخيال
''',
'''
وإذا بناقض نفسي كلنا منحتوي أعداد،
أنا اللي كبرت. أنا اللي قبلت. أنا اللي قلت
''',
'''
خذ العباب عني
أنا أسيـر مرايتي
''',
'''
عم برجع ناديلك
إعتقني شياطيني
بسقي بدمّها ترابك
لعلّه ينمى لحني
''',
'''
جازيني
سَيطر على فمي
جازي العباد
''',
'''
الكلمات تنفَّس
بس الحياة تنفُّس
''',
'''
طيفك بيِرعبْني
شفته عطول عمري
''',
'''
لو بس يسـامرني
عسى الكلام يرعاني
''',
'''
كانت الدفاتر بيضاء وحياتنا ما بتتغنى،
والراديو يذيع مللنا يا أما خمسة أو خمسين مرة
''',
'''
لمرّة سمعنا فارس قال لنا نردم معابدنا
رحنا وعمّرنا له معبد ثاني بمحلّها
''',
'''
سلّطنا الضوء على وجهه لما طلع حتى يمكسج
ما شفنا غير خياله إختفى وجهه تحت الوهج،
ويطلع يعزف ليتخيّل حاله بالأفلام،
وإحنا نصدّق حكيُه حتى نبرّر الأصنام
''',
'''
حرّفوه، ردّدوه، قدّسوه، ورتّلوه
''',
'''
طربنا بحفلاته لما بلش يلعبلنا
الأسرار اللي خربشناها على الحيط بحمّاماتنا
فسّر الأغنية فصلبناه بخشب المسرح
كان يكتب من الجوع وما في أكل على المذبح
''',
'''
كلن عم يرقُصوا فوق القزاز عالأرض
كلن عم بيضحكوا بالأسود و الأبيض
''',
'''
بتشقشق بسْمتي أسود وأبيض
نحنا بعدنا شي متعرِفين ع بعض
''',
'''
لدقيقة بالحمّام كنا أقربِ الأصحاب
زيِّفلي الإهتمام قول لي إنني بِنحَبّ
''',
'''
إبن الليل
إبن الليل
''',
'''
كل الأسبوع تسعة للخمسة عم نموت
نسّيني حالي بدّي كون مثل بيروت
شو حلوة الليلة كل شيء منتمنّاه موجود
وبؤذي نفسي بس لَبَرِّر الوُجود
''',
'''
بتذكُر كيف كانت الموسيقى تؤثّر فينا؟
صرنا نخشى العتمة يلّي كنا نلعب فيها
''',
'''
عشنا وشفنا وما بقي ولا شي يدهشنا
عالية الموسيقى مش معقول حدن يسمعنا
''',
'''
ولّعتها مبارح حاسس حالي شوي تعبان
كأني دايماً عم بغرق بعدني عطشان
دعسة عالشمال وعل يمين حطّ دعستين
لأ مش عم ببكي دمّعت من الدخان
''',
'''
وبصبّ الكاس لاثنين وبشربُه لوحدي
مين قولك من هالناس رح يجي يزورلي قبري؟
''',
'''
ليك عندك قدّاحة؟ تع ولّعلي سيجارتي
ليك شو في حولي ناس مش ممكن كون لوحدي
''',
'''
داويني بشي حبّة لما أنزل
''',
'''
لا تحرمني القنّينة لما أنزل
''',
'''
نسّيني إيدين بيّي لمّا أنزل
بتعاقبني لما أطلع حتى أنزل
''',
'''
غيرنا روض أعاصير ليتحكم بالمصير
ونحن من نسيم منطير ومنرتد على التدمير
وبس تتجرأ بسؤال عن تدهور الأحوال
بسكتوك بشعارات عن كل المؤامرات
''',
'''
خونوك القطيع كل ما طالبت بتغيير الوطن
يأسوك حتى تبيع حرياتك لما يضيع الوطن
''',
'''
قالولك
حاج تبشر تع رقصني شوي
ليش مكشر تع رقصني شوي
''',
'''
علموك النشيد قالوا صراعك مفيد للوطن
خدروك بالوريد قالوا خمولك مفيد للوطن
''',
'''
إياك التطوس بالعروش
الطغيان يزهر عصيان
لو راح أموت مئة مرة
رح أعود مئة مرة
مصقول الحسام
''',
'''
أتشظى جيشا يشبهني
نلتحم ببعض ونستعصي
''',
'''
جيشك ومعاليه
مش حيقدرلي
ما بتقدر على قلبي
مش حتقدرلي
''',
'''
في قاع كل شاهق ترتبي
أنبت مصقول الأقلام
''',
'''
الجبال حاملوها
بدأو بحصاها حتى أنجزوا
''',
'''
حيث القوة تبنى بالوجوم
كل صوت يرفع هجوم
''',
'''
لكم قيمكم
والحب لنا
لكم عاداتكم
لنا الموسيقى
لكم تقاليد
لنا المستقبل
لكم قيمكم
والحب لنا
''',
'''
بْيِنما كون ع جسمي
ولما ايدك بتلمسني
وفجأة الدنيا بتردلي
ياللي اخدتو مني
ربي
نفخ الحب بصدري
''',
'''
صعبان عليا يا زمان
أسامح سنين الحرمان
خلاص هوانهم كان زمان
''',
'''
ياللي إنت حصتي بالدنيا
العمر قبلك ضاع سُدى
يا مبرر عمري بالهوى
''',
'''
حبيبي
حرّرني من جهلي
عوضلي
سنيني اللي فاتتني
''',
'''
طلاع يا ابني لوديك وين ما بدك تروح
المشوار صعب وطويل وبيمتحن الروح
''',
'''
بس كبر جسمي صغر قلبي ليتحمل
طعم الخل يللي لقيتو بدل العسل
''',
'''
فيك تسوق يا ما تنساق بيرجعلك الخيار
قبل ما العالم ينساك بأخر المشوار
''',
'''
شئت أم أبيت العربيه رح تمشي
و مشوارك ما إلو معنى متل كل شي
''',
'''
غصباً عنك رح بتموت
''',
'''
بتتذكري لما قلتيلي
انك راح تتزوجني
بلا فلوس وبلا بيت
''',
'''
بتتذكري كنتي تحبيني
مع انني مش دخله دينك
بتتزكري كيف كنا هيك
''',
'''
بتتزكري لما امك
شفتني نايم بتختك
قالتلي انسى عنك
''',
'''
و اتفقنا نضلنا هيك
بلا أدوار و طنطنات
بلا كرفات و صبحيات
''',
'''
بلا ملايين
بلا فساتين
''',
'''
مسكتيلي ايدي و وعدتيني بشي ثورة
كيف نسيتي كيف نسيتيني
''',
'''
ومشطيلي شعري
وبعتيني عالدوام
كيف بتمشط مشطيني
''',
'''
بتتذكري لما قلتيلي انك نوي تتركيني
بلا فلوس و بلا بيت
''',
'''
مش كل شي نفع ضاربة عين
و أنا بيني و بينك مليونين
''',
'''
غنيلي عن ألباتنجان
كل شي ما عدا كيف تعبان
''',
'''
الوضع بالمعاملتين
و أنا مني واقف تحت أمرين
أمير و ملاك و سيستين
مش نافعة دخل ال مضربان
''',
'''
كان بودي خليك بقربي
عرفك عأهلي وتتوجلي قلبي
اطبخ أكلتك أشطفلك بيتك
دلع ولادك أعمل ست بيتك
بس إنت ببيتك و أنا بشي بيت
والله يا ريتك ما بعمرك فليت
''',
'''
قوم نحرق هالمدينة و نعمر واحدة أشرف
''',
'''
قوم ننسى هالزمان و نحلم زمن ألطف
''',
'''
مازالك بلا شىء ما فيك تخسر شىء
و أنا مليت من عشرة نفسى
''',
'''
كان بدى غير العالم مش عارف كيف العالم غيرنى
''',
'''
كان بدى احمل السماء وهلأ أنجق حامل نفسى
''',
'''
قول اننى منيح
قول اننى منيح
''',
'''
مش ناوي إبلع أكاذيبك
الكلام رح يحرق حلقي
''',
'''
مش ناوي شرّح نواياك
خلّي لسانك بقفصه
''',
'''
خلّي الوقت الذي أعطيته لك
وأقتل النفس التي كنتها لك
''',
'''
بسّ قبل ما تقبرني
قلّ لي شو كان سعري
''',
'''
الدود ينحت جسدي
الأرض تحضن جلدي
كيف بتبيعني للرومان
''',
'''
الدود ينحت جسدي
الأرض تحضن جلدي
كيف خسرتك للرومان
''',
'''
بين الشوارع صوت بيحوم
لقبوه عبدو المظلوم
قالوا مرة كان مغروم
بأرملة من بيت سلوم
''',
'''
قبرت قلبها والمرحوم
ونكرت صوته للمظلوم
عبدو يللي كان مغروم
قرر عن الحب يصوم
''',
'''
نسوان الحي مصمودين
ببيوت رجالها المخمورين
شوفي يا جارة شوفي مين
اجا يغني ها المسكين
''',
'''
وبيتدلوقوا محمومين
على الشارع مصفوفين
بإنتظار عبدو المسكين
ليغني بصوته الحزين
''',
'''
ورد خذي ورد يا ورد
ورد أحلى ورد يا ورد
ما إلو أريج هل ورد
''',
'''
بنام وبستدعيك بأحلامي
بتخيل ايديك محل ايدي
''',
'''
ليش بركعلك ليش برجعلك بس تخنقني
ليش بشفعلك ليش بخضعلك بس تحرقني
''',
'''
قول إنو برضيك كيف ما بيرضيك
وبس يبوسك وين ببوسك بعدك بتتخيلني
''',
'''
قلبي بيدق على بابك وبتشنقني بالوتين
قلبي بيرميني أمام رجليك
''',
'''
كان نفسي احميك وتؤذيني
كان نفسي أؤذيك و تحميني
من عيوبي و ذنوبي و ندوبي
بعيوبي وذنوبي وندوبي
''',
'''
قلبي بيدق على بابك وبتشنقني بالوتين
''',
'''
قلبي بيرميني أمام رجليك
''',
'''
دوب الليل بكأسي عشان أنام
الصحو بلاك ما فيه سلام
''',
'''
قلبي بيدق على بابه
وبيشتهي غيابه
''',
'''
قلبي بيدق على بابه
وبيلتهف عذابه
''',
'''
نبضه بيدق إيقاع كان يسمعله قبل ما استأصلوه
''',
'''
كان في خيار وإنت رقصت
كنا أحرار وإنت رقصت
كان في خيار وإنت رقصت
بالإنتحار وإنت رقصت
''',
'''
بالإقاع إستعبدوك، برمجوك وعلموك
كيف ترقص زيهم
''',
'''
صورتك عم تتلف بالمخفى اذبها لتحرر ضميرك
''',
'''
ما تتركني هيك
عم فتش عليك
بأسفل كل الكاس
وبين تخوت الناس
''',
'''
بتوهم وجك
بنادي اسمك
كأنه موشوم
عشفايفي بسموم
''',
'''
يا ليل إحجبني حجبني بعتمتك
يا ليل إملئني قويني بعتمتك
''',
'''
أخوي شاف السر شاف السر كان حيبوح
أخوي جوا الموج جوا الموج عمبينوح
''',
'''
والصيادين نائمين
''',
'''
يا بحر رجعلي رجعلي أخوي
الموج سرقلي خطفلي أخوي
اخذته حد البحر خلي الموج يطهره
أخذته حد البحر دبغت الموج بدمه
والصيادين غافلين خامدين نائمين
''',
'''
أخوي مع الحورية
رجعوه لي
الموج أخذلي أخوي
رجعوه لي
''',
'''
أخوي راح مع الفجر
لسا ما عاد لي
أخوي بقعر البحر
لسا ما عاد لي
''',
'''
ﻳﺎ ﺇﻡ ﻻﺟﺎﻛﻴﺖ ﻭﺍﻟﺒﻨﻄﻠﻮﻥ
ﺷﻔﺘﻚ ﻭﺍﻗﻔﺔ ﻓﻮﻕ ﺍﻟﺒﻠﻜﻮﻥ

ﺧﻤﻨﺘﻚ ﺷﺎﺏ ﻳﺎ ﻣﺪﻣﻮﺯﻳﻞ
ﻻ ﺗﻮﺍﺧﺬﻳﻨﻲ ﺑﺎﺭﺩﻭﻥ
''',
'''
ﺷﻔﺘﻚ ﻻﺑﺴﺔ ﺑﻴﺮﻳﻪ ﻭﻛﺎﺳﻜﻴﺖ
ﻃﺎﻟﻌﺔ ﺑﺎﻟﺴﻮﻕ ﺑﺜﻴﺎﺏ ﺍﻟﺒﻴﺖ
ﻣﻦ ﻏﻴﺮ ﺑﻮﺩﺭﺓ ﻣﻦ ﻏﻴﺮ ﺗﻮﺍﻟﻴﺖ
ﻭﻗﺎﺻﺔ ﺷﻌﺮﻙ ﺍﻻ جاﺭﺳﻮﻥ

ﺧﻤﻨﺘﻚ ﺷﺎﺏ ﻳﺎ ﻣﺪﻣﻮﺯﻳﻞ
ﻻ ﺗﻮﺍﺧﺬﻳﻨﻲ ﺑﺎﺭﺩﻭﻥ ﺑﺎﺭﺩﻭﻥ
''',
'''
ﺷﻔﺘﻚ ﻃﺎﻟﻌﺔ بليل ﻭﺣﺪﻙ
ﺭﺍﻳﺤﺔ ﺟﺎﻱ ﻭﻳﻦ ﻣﺎ ﺑﺪﻙ
ﻃﺎﻟﻌﺔ ﻣﻦ ﻫﻮﻥ
ﻧﺎﺯﻟﺔ ﻣﻦ ﻫﻮﻥ

ﺧﻤﻨﺘﻚ ﺷﺎﺏ ﻳﺎ ﻣﺪﻣﻮﺯﻳﻞ
ﻻ ﺗﻮﺍﺧﺬﻳﻨﻲ ﺑﺎﺭﺩﻭﻥ
''',
'''
مش عارف ان كنت رجل أم مصرف آلى
بس الأجار يا خيى صاير سوبر غالى
''',
'''
تزوجنى و أقرأ أنجلز فى سريرى
أذبح الخروف قسم وزع عالجيرة
''',
'''
الحل رومانسى بس مش غلط
''',
'''
حبك كسرة القطاع الخاص بس مش غلط
''',
'''
زفوا العروس زفوها
''',
'''
قاعد مش شايف الا حالى
مش شايف حدن غيرى
مش شايف الا زبالة
''',
'''
لا تعملى جونغار ولا أنا أعمل لك شويكار
حاج تعملى شيشى يا أخى ما بدى شيشى
و رصاص و رصاص و رصاص
''',
'''
ماشى و الزفت الذى بوجهى
يا أخى مثل اجرى
ماوجهى بلع اجرى
و رصاص و رصاص و رصاص
''',
'''
ﺑﻌﻤﺮﻩ ﻣﺎ ﺑﻴﻠﻮﻡ ﻧﻔﺴﻪ

ﻛﻞ ﺷﻲ ﺑﻴﺼﻴﺮ ﺑﺮﺍﺕ ﻧﻔﺴﻪ

ﻣﺎ ﺑﻮ شي

ﺷﻮ ﺑﻮ شي
''',
'''
ﺣﺒﻴﺒﻲ ﺑﻴﺤﻜﻲ ﺑﺎﻷﺟﻨﺒﻲ

ﻭﺑﻴﻠﺪﻍ ﺑﺎﻟﻌﻐﺒﻲ

ﻣﺎ ﺑﻮ شي

ﺷﻮ ﺑﻮ شي

''',
'''
ﺷﻮﻑ ﺍﻟﻜﺘﺎﺏ ﻋﻤﺒﻴﺘﺠﻌﻠﻚ ﺗﺤﺖ ﺍﻟﻤﺨﺪﺓ

ﻭﺭﺍﺋﺤﺔ ﺷﻌﺮﻙ ﻏﺎﻟﺸﺮﺷﻒ ﺣﺪﻱ

ﻭﺍﻟﻨﺎﺱ ﺩﺍﺋﺮﺓ ﺑﺴﻴﺎﺭﺍﺗﻬﺎ ﺑﺮﺍﺕ ﺍﻟﺸﺒﺎﻙ

ﻭﺃﻧﺎ ﻗﺎﻋﺪ ﻣﺜﻞ ﺍﻟﺘﺮﺑﺔ ﺿﺎﺋﻊ ﺑﻴﻦ ﺇﺩﻳﻚ
''',
'''
ﻭﺃﻧﺎ ﻗﺎﻋﺪ ﻣﺜﻞ ﺍﻟﺘﺮﺑﺔ ﺿﺎﺋﻊ ﺑﻴﻦ ﺇﺩﻳﻚ
''',
'''
إذا كنت مشي عمبتكزدر عل الكورنيش
بدي لتلت
''',
'''
إذا كنتي مشيه لبسه شي فستان قصير
بدي لتلت
''',
'''
إذا كنتو تنين اه أهلين شي فلتان
بدي لتلت
''',
'''
وإذا رح تنهان أفضلان عندي لسان
بدو يلتليت
''',
'''
إذا كنت وئف بدي لطش على الكوع
بدا تلتليت
و إذا كنت مصروع يا دلوع
مش ممنوع
بس حلتلت
''',
'''
و إذا كنت مقهور
راح بتفور كيف ما تدور
بادي لتلت
''',
'''
المهم منك مستور
و يي شرشور أم ندور
حتى نلتلت
''',
'''
بعده قاعد بمحله
بعده ممسمر ماسك فردو
شعره مزبط هيدا همو
هاجم صوبي نفخ صدره
''',
'''
بيتي هون مش جاي فجره
ناسي الكون عاملني شغله
و أنا بخرس بما إنو
دمعة امي أغلى منو

و إختو و ستو و خيو و جدو
و بايو و خلو و عمو
خلتو و خالو و ستو و جدو و عمو
عمو
''',
'''
صارلنا خمسين سنة بنحارب
الحرب نفسها . ما بننسى
والبلد قاعة انتظار
والطابور واصل ع المطار
''']

def postLyrics():
    try:
      api.update_status(random.choice(lyrics))
      print(len(lyrics))
    except tweepy.errors.TweepyException as error:
      print(error.api_codes)
      if error.api_codes[0] == 187:
          print('duplicate message')
      else:
          raise error

schedule.every(120).minutes.do(postLyrics)
postLyrics()
while True:
    schedule.run_pending()
    time.sleep(1)